---
kind: method
id: M:Autodesk.Revit.DB.PlanViewRange.GetOffset(Autodesk.Revit.DB.PlanViewPlane)
source: html/109ec4bc-f4d5-e995-bc93-92c2b498674f.htm
---
# Autodesk.Revit.DB.PlanViewRange.GetOffset Method

Get the offset value associated with a View Depth plane

## Syntax (C#)
```csharp
public double GetOffset(
	PlanViewPlane planViewPlane
)
```

## Parameters
- **planViewPlane** (`Autodesk.Revit.DB.PlanViewPlane`) - View Depth plane

## Returns
Offset value

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration